init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs Org Init File</title>
<!-- 2017-07-18 Tue 22:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Vander Woude" />
<link rel="stylesheet" type="text/css" href="init.css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Org Init File</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Path Setup</a>
<ul>
<li><a href="#sec-1-1">1.1. Lisp</a></li>
<li><a href="#sec-1-2">1.2. Themes</a></li>
</ul>
</li>
<li><a href="#sec-2">2. General Settings</a></li>
<li><a href="#sec-3">3. Other Initialization</a>
<ul>
<li><a href="#sec-3-1">3.1. Org Theme</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Preinstalled</a>
<ul>
<li><a href="#sec-4-1">4.1. Org Mode</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Add Templates</a></li>
<li><a href="#sec-4-1-2">4.1.2. Set Code Font Effects</a></li>
<li><a href="#sec-4-1-3">4.1.3. Add Drawers</a></li>
<li><a href="#sec-4-1-4">4.1.4. Set Babel Languages</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Highlight Line</a></li>
<li><a href="#sec-4-3">4.3. Ido</a></li>
<li><a href="#sec-4-4">4.4. Line Numbers</a></li>
<li><a href="#sec-4-5">4.5. Column Numbers</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Installs</a>
<ul>
<li><a href="#sec-5-1">5.1. Package Setup</a></li>
<li><a href="#sec-5-2">5.2. Melpa</a>
<ul>
<li><a href="#sec-5-2-1">5.2.1. Multiple Cursors</a></li>
<li><a href="#sec-5-2-2">5.2.2. Magit</a></li>
<li><a href="#sec-5-2-3">5.2.3. Auto Complete</a></li>
<li><a href="#sec-5-2-4">5.2.4. Ess</a></li>
<li><a href="#sec-5-2-5">5.2.5. Tramp</a></li>
<li><a href="#sec-5-2-6">5.2.6. Evil Numbers</a></li>
<li><a href="#sec-5-2-7">5.2.7. CSV</a></li>
<li><a href="#sec-5-2-8">5.2.8. Icicles</a></li>
<li><a href="#sec-5-2-9">5.2.9. YASnippet</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3. Manual</a>
<ul>
<li><a href="#sec-5-3-1">5.3.1. M2</a></li>
<li><a href="#sec-5-3-2">5.3.2. Window Number</a></li>
<li><a href="#sec-5-3-3">5.3.3. Ace Jump</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-6">6. My Functions</a>
<ul>
<li><a href="#sec-6-1">6.1. Return Key Functionality</a></li>
<li><a href="#sec-6-2">6.2. Save Macros as Functions</a></li>
<li><a href="#sec-6-3">6.3. Transparency</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Global Key Bindings</a>
<ul>
<li><a href="#sec-7-1">7.1. Window Movement</a></li>
<li><a href="#sec-7-2">7.2. Mutliple Cursors</a></li>
<li><a href="#sec-7-3">7.3. Magit</a></li>
<li><a href="#sec-7-4">7.4. Ace Jump</a></li>
<li><a href="#sec-7-5">7.5. Move Backward Key Swap</a></li>
<li><a href="#sec-7-6">7.6. Evil Numbers</a></li>
<li><a href="#sec-7-7">7.7. Helm</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Final Calls</a></li>
<li><a href="#sec-9">9. Not Executed</a>
<ul>
<li><a href="#sec-9-1">9.1. Code Completion</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Path Setup</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Lisp</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'load-path "~/.emacs.d/lisp/")
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Themes</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Add all subdirectories of ~/.emacs.d/themes/ to the custom-theme-load-path
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(let ((basedir "~/.emacs.d/themes/"))
      (dolist (f (directory-files basedir))
	(if (and (not (or (equal f ".") (equal f "..")))
		 (file-directory-p (concat basedir f)))
	    (add-to-list 'custom-theme-load-path (concat basedir f)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> General Settings</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(load-theme `wombat)
;;(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(setq frame-title-format "Emacs")
(setq inhibit-splash-screen t)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Other Initialization</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Org Theme</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This has to be before requiring Org
This source is influence by <a href="http://orgmode.org/worg/org-contrib/babel/examples/fontify-src-code-blocks.html">this orgmode.org post</a> and this <a href="https://emacs.stackexchange.com/questions/14824/org-block-background-font-not-having-effect/14886">StackExchange post</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(set-face-attribute 'org-block-begin-line nil :background "#555" :foreground "#000" :underline "000")
(set-face-attribute 'org-block-end-line nil :background "#555" :foreground "#000" :overline "000")
(set-face-attribute 'org-block-background nil :background "#666")

;; (defface org-block-begin-line
;;   '((t (:underline "#FFF" :foreground "#999" :background "#050505")))
;;   "Face used for the line delimiting the begin of source blocks.")
;; (defface org-block-background
;;   '((t (:background "#AAA")))
;;   "Face used for the source block background.")
;; (defface org-block-end-line
;;   '((t (:overline "#A7A6AA" :foreground "#008ED1" :background "#EAEAFF")))
;;   "Face used for the line delimiting the end of source blocks.")
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Preinstalled</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Org Mode</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Add Templates</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Add an elisp template bound to <i>&lt;m + TAB</i>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-to-list 'org-structure-template-alist
	     '("m" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC" "&lt;src lang=\"?\"&gt;\n\n&lt;/src&gt;"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Set Code Font Effects</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Set coloring of elisp blocks
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">;;   (require 'color)
;; 
;;   (set-face-attribute 'org-block nil :background
;;                       (color-darken-name
;;                        (face-attribute 'default :background) 3))
;; 
;;   (setq org-src-block-faces '(("emacs-lisp" (:background "#EEE2FF"))
;;                               ("python" (:background "#E5FFB8"))))

  (setq org-src-fontify-natively t)
;;   (org-block-begin-line
;;     ((t (:underline "#F00" :foreground "#0F0" :background "#00F"))))
;;   (org-block-background
;;     ((t (:background "#F0F"))))
;;   (org-block-end-line
;;     ((t (:underline "#0F0" :foreground "#00F" :background "#F00"))))
</pre>
</div>
</div>
</div>
