init.org
** Move Backward Key Swap
#+BEGIN_SRC emacs-lisp
  ;; Swap M-b with M-j and C-b with C-j to give a more convenient
  ;; forward backward movement I'm not sure this is the best route since
  ;; there are times that I would like to use C-j as intended e.g. in
  ;; helm mode C-j is used to expand the current selection and now I'm
  ;; forced to use C-b to do so But I don't think I can just use
  ;; global-set-key to change the behavior the functions called are
  ;; context dependent

  ;; (define-key key-translation-map (kbd "C-b") (kbd "C-j"))
  ;; (define-key key-translation-map (kbd "C-j") (kbd "C-b"))

  ;; (define-key key-translation-map (kbd "M-b") (kbd "M-j"))
  ;; (define-key key-translation-map (kbd "M-j") (kbd "M-b"))
#+END_SRC

** Evil Numbers
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c +") 'evil-numbers/inc-at-pt)
  (global-set-key (kbd "C-c -") 'evil-numbers/dec-at-pt)
  (global-set-key (kbd "<kp-add>") 'evil-numbers/inc-at-pt)
  (global-set-key (kbd "<kp-subtract>") 'evil-numbers/dec-at-pt)
#+END_SRC

** Helm
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x b") 'helm-buffers-list)
  (global-set-key (kbd "C-x C-f") 'helm-find-files)
#+END_SRC

** Register Jump
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-z") 'jump-to-register)
#+END_SRC

** Origami
#+BEGIN_SRC emacs-lisp
  (define-key global-map (kbd "<S-iso-lefttab>") 'origami-forward-toggle-node)
#+END_SRC

** Horizontal Centering
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-S-l") 'my-horizontal-recenter)
#+END_SRC

* Final Calls
Starting a server allows using the emacsclient so that session info to be shared across frames
#+BEGIN_SRC emacs-lisp
  (if (and (fboundp 'server-running-p) 
           (not (server-running-p)))
      (server-start))
#+END_SRC

* Not Executed

** Code Completion
This segment inspired by this [[https://www.youtube.com/watch?v%3DHTUE03LnaXA][YouTube video]]
#+BEGIN_QUOTE
;; this function doesn't seem to be working yet
(defun my:ac-c-header-init()
  ;; Run command 'gcc -xc++ -E -v -' to find location of c++ header files on system
  (require 'auto-complete-c-headers)
  (add-to-list 'ac-sources 'ac-source-c-headers)
  (setq achead:include-directories
   (append '("/usr/include/c++/5"
             "/usr/include/x86_64-linux-gnu/c++/5"
             "/usr/include/c++/5/backward"
             "/usr/lib/gcc/x86_64-linux-gnu/5/include"
             "/usr/lib/gcc/x86_64-linux-gnu/5/include-fixed"
             "/usr/include/x86_64-linux-gnu")
             achead:include-directories)))
(add-hook 'c++-mode-hook 'my:ac-c-header-init)
(add-hook 'c-mode-hook 'my:ac-c-header-init)
;; flymake-google-cpplint comes from melpa
(defun my:flymake-google-init()
  (require 'flymake-gogle-cpplint)
  ;; in order to use this run from shell 'pip install cpplint'
  (custom-set-variables
   '(flycheck-c/c++-googlelint-executable "/usr/local/bin/cpplint.py"))
;;  (custon-set-variables
;;   '(flymake-gogle-cpplint-command "./.local/lib/python2.7/site-packages/cpplint.pyc"))
  (flymake-google-cpplint-load))
(add-hook 'c++-mode-hook 'my:flymake-google-init)
(add-hook 'c-mode-hook 'my:flymake-google-init)
;; NOTE: header files and cpplint don't seem to be working
#+END_QUOTE
** Tips
- M-h (org-mark-element)
- M-= (count-words-region START END &optional ARG)
