init.html

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5"><span class="section-number-3">7.5</span> Move Backward Key Swap</h3>
<div class="outline-text-3" id="text-7-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">;; Swap M-b with M-j and C-b with C-j to give a more convenient
;; forward backward movement I'm not sure this is the best route since
;; there are times that I would like to use C-j as intended e.g. in
;; helm mode C-j is used to expand the current selection and now I'm
;; forced to use C-b to do so But I don't think I can just use
;; global-set-key to change the behavior the functions called are
;; context dependent

;; (define-key key-translation-map (kbd "C-b") (kbd "C-j"))
;; (define-key key-translation-map (kbd "C-j") (kbd "C-b"))

;; (define-key key-translation-map (kbd "M-b") (kbd "M-j"))
;; (define-key key-translation-map (kbd "M-j") (kbd "M-b"))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6"><span class="section-number-3">7.6</span> Evil Numbers</h3>
<div class="outline-text-3" id="text-7-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "C-c +") 'evil-numbers/inc-at-pt)
(global-set-key (kbd "C-c -") 'evil-numbers/dec-at-pt)
(global-set-key (kbd "&lt;kp-add&gt;") 'evil-numbers/inc-at-pt)
(global-set-key (kbd "&lt;kp-subtract&gt;") 'evil-numbers/dec-at-pt)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7"><span class="section-number-3">7.7</span> Helm</h3>
<div class="outline-text-3" id="text-7-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(global-set-key (kbd "C-x b") 'helm-buffers-list)
;; (global-set-key (kbd "C-x C-f") 'helm-find-files)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Final Calls</h2>
<div class="outline-text-2" id="text-8">
<p>
Starting a server allows using the emacsclient so that session info to be shared across frames
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(if (and (fboundp 'server-running-p) 
	 (not (server-running-p)))
    (server-start))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Not Executed</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Code Completion</h3>
<div class="outline-text-3" id="text-9-1">
<p>
This segment inspired by this <a href="https://www.youtube.com/watch?v=HTUE03LnaXA">YouTube video</a>
</p>
<blockquote>
<p>
;; this function doesn't seem to be working yet
(defun my:ac-c-header-init()
  ;; Run command 'gcc -xc++ -E -v -' to find location of c++ header files on system
  (require 'auto-complete-c-headers)
  (add-to-list 'ac-sources 'ac-source-c-headers)
  (setq achead:include-directories
   (append '("/usr/include/c++/5"
             "/usr/include/x86<sub>64</sub>-linux-gnu/c++/5"
             "/usr/include/c++/5/backward"
             "/usr/lib/gcc/x86<sub>64</sub>-linux-gnu/5/include"
             "/usr/lib/gcc/x86<sub>64</sub>-linux-gnu/5/include-fixed"
             "/usr/include/x86<sub>64</sub>-linux-gnu")
             achead:include-directories)))
(add-hook 'c++-mode-hook 'my:ac-c-header-init)
(add-hook 'c-mode-hook 'my:ac-c-header-init)
;; flymake-google-cpplint comes from melpa
(defun my:flymake-google-init()
  (require 'flymake-gogle-cpplint)
  ;; in order to use this run from shell 'pip install cpplint'
  (custom-set-variables
   '(flycheck-c/c++-googlelint-executable "/usr/local/bin/cpplint.py"))
;;  (custon-set-variables
;;   '(flymake-gogle-cpplint-command "./.local/lib/python2.7/site-packages/cpplint.pyc"))
  (flymake-google-cpplint-load))
(add-hook 'c++-mode-hook 'my:flymake-google-init)
(add-hook 'c-mode-hook 'my:flymake-google-init)
;; NOTE: header files and cpplint don't seem to be working
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jason Vander Woude</p>
<p class="date">Created: 2017-07-18 Tue 22:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
